src/cf/InformationRegisters/ИсполнителиРолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиРолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СотрудникиВКонтейнерах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиВКонтейнерах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ЗамещающиеИПомощники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЗамещающиеИПомощники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗамещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗамещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыЗамещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбластиЗамещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтбора</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеОтбораОбластиЗамещения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ИсполнителиРолей/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ИзменяемыеЗаписи;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить(
		"ПараметрыОбновленияДанныхКэширующихОбъектов",
		РегистрыСведений.ИсполнителиРолей.ЗначенияПараметровОбновленияДанныхКэширующихОбъектов(ЭтотОбъект));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление записей в регистре ИсполнителиРолейИДелегаты
	Исполнитель = Неопределено;
	Если Отбор.Найти("Исполнитель") <> Неопределено
		И Отбор.Исполнитель.Использование Тогда
		
		Исполнитель = Отбор.Исполнитель.Значение;
	КонецЕсли;
	
	РольИсполнителя = Неопределено;
	Если Отбор.Найти("РольИсполнителя") <> Неопределено
		И Отбор.РольИсполнителя.Использование Тогда
		
		РольИсполнителя = Отбор.РольИсполнителя.Значение;
	КонецЕсли;
	
	СотрудникиДляОбновленияЗамещающих = Новый Массив;

	РегистрыСведений.ИсполнителиРолейИДелегаты.ОбновитьЗаписиПоИсполнителюРоли(
		Исполнитель, РольИсполнителя);
		
	// Обновление контейнеров и данных адресной книги.
	РолиДляОбновленияКонтейнеров =
		ДополнительныеСвойства.ПараметрыОбновленияДанныхКэширующихОбъектов.РолиДляОбновленияКонтейнеров;
			
	// Замещающие и помощники.
	СтарыеСоставыКонтейнеров =
		РегистрыСведений.СотрудникиВКонтейнерах.СотрудникиВКонтейнерах(РолиДляОбновленияКонтейнеров);
	
	РегистрыСведений.ИсполнителиРолей.ОбновитьДанныеКэширующихОбъектов(
		ЭтотОбъект, ДополнительныеСвойства.ПараметрыОбновленияДанныхКэширующихОбъектов);
	
	НовыеСоставыКонтейнеров =
		РегистрыСведений.СотрудникиВКонтейнерах.СотрудникиВКонтейнерах(РолиДляОбновленияКонтейнеров);
	
	Для Каждого КлючИЗначение Из СтарыеСоставыКонтейнеров Цикл
		Роль = КлючИЗначение.Ключ;
		СтарыйСостав = КлючИЗначение.Значение;
		НовыйСостав = НовыеСоставыКонтейнеров[Роль];
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СотрудникиДляОбновленияЗамещающих,
			ОбщегоНазначенияКлиентСервер.РазностьМассивов(НовыйСостав, СтарыйСостав), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СотрудникиДляОбновленияЗамещающих,
			ОбщегоНазначенияКлиентСервер.РазностьМассивов(СтарыйСостав, НовыйСостав), Истина);
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.ЗамещающиеИПомощники КАК ЗамещающиеИПомощники
		|ГДЕ
		|	Сотрудник В (&СотрудникиДляОбновленияЗамещающих)
		|	И Действует");
	Запрос.УстановитьПараметр("СотрудникиДляОбновленияЗамещающих", СотрудникиДляОбновленияЗамещающих);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ОбработкаОчередиЗаданийСервер.ДобавитьЗаданиеОбновитьДанныеЗадачПоЗамещению(Выборка.Ссылка) Тогда
			Справочники.ЗамещающиеИПомощники.ОбновитьДанныеЗадачПоЗамещению(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Обрабатываем изменившиеся роли.
	РаботаСВнешнимПодписанием.ИсполнителиРолейПриЗаписи(
		СтарыеСоставыКонтейнеров,
		НовыеСоставыКонтейнеров,
		Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
